# nano version
# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 0.5  # model depth multiple (reduced)
width_multiple: 0.5  # layer channel multiple (reduced)
activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [8, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [16, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, ELAN1, [16, 16, 8]],  # 2

   # avg-conv down
   [-1, 1, AConv, [32]],  # 3-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [32, 32, 16, 3]],  # 4

   # avg-conv down
   [-1, 1, AConv, [48]],  # 5-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [48, 48, 24, 3]],  # 6

   # avg-conv down
   [-1, 1, AConv, [64]],  # 7-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],  # 8
  ]

# elan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [64, 32]],  # 9

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [48, 48, 24, 3]],  # 12

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [32, 32, 16, 3]],  # 15

   # avg-conv-down merge
   [-1, 1, AConv, [24]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [48, 48, 24, 3]],  # 18 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, AConv, [32]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],  # 21 (P5/32-large)

   # detect
   [[15, 18, 21], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
